# Project: ZG3Doc
# File : test1.py
# Date : 2023/4/14 10:26
# Author: Younger Shen <申延刚>
# Web: https://github.com/youngershen
# Cell: 13811754531
# Wechat: 13811754531
# Email : shenyangang@163.com
"""
专高三 周考一 2022 年 9 月
"""

"""
（一）创建名为my_numpy.py的文件，完成相关Numpy的操作  （50分,每题5分)
1）输入数字n，创建数字从 1 到 n 的 1 维数组arr，将 arr 中的所有偶数替换成 -2
2）给定数组[1, 2, 3, 4, 5]，获取到平均值，将平均值插入到每个元素直接得到新的数组
3）创建一个5*5的随机值数组，并找到最大值，并替换为0
4）使用numpy获取昨天、今天、明天的日期
5）创建一个5*3随机矩阵和一个3*2随机矩阵，求矩阵积
6）如何从数组np.array([1, 2, 0, 0, 4, 0])中找出非0元素的位置索引
7）请将给定的数组np.array([100,103,106,108,112,116,118,136,138,139])中的奇数批量替换为33
8）请生成一个从201-300的一维数组，并将这个一维数组转化为10行10列的二维数组
9）有两个数组，x=np.array([436,556,607,899]),y=np.array([556,559,607,936,966]),请使用合适的方法获取两个数组的公共项
10）计算给定数组np.array([33,35,60,70,85])和np.array([44,51,65,73,80])之间的欧氏距离
（二）创建名为my_pandas.py的文件，完成相关pandas的操作  （50分,每题5分)
11）读取某航空公司会员.xlsx文件，形成一个dataframe
12）针对缺失值做合理的预处理
13）针对重复值做合理的预处理
14）按会员卡级别的降序，年龄的升序，对数据进行排序
15）增加一列，列名为"普通积分"，为总积分与精英积分的差值
16）增加一列，列名为“会员特征”，条件为：会员卡级别大于5，同时年龄小于40，为“明日之星”；否则为“普通会员”
17）将普通积分的最低值的行进行删除
18）将以上处理后的df写入到本地的json文件中
19）将以上处理后的df写入到本地的mysql中,表自定义
20）读取对应的表,查询表内所有结果
"""